<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Dell Display Manager and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jannheider.recipes.munki.DellDisplayAndPeripheralManager</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>DDPM</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>AutoLaunchDDPMHelper.app</string>
				<string>DDPM.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Dell Display Manager for macOS</string>
			<key>developer</key>
			<string>Dell Inc.</string>
			<key>display_name</key>
			<string>Dell Display Manager</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
            <key>preinstall_script</key>
            <string>#!/bin/bash
# This preinstall script to stop de DDPM
# v0.1 - Jann Heider - AgenturAdmin.de

# If the application is running stop it
if /bin/ps -ax | /usr/bin/grep "DDPM" | grep -v grep
then
  /usr/bin/killall "DDPM"
  /usr/bin/killall "DDPMWebcamService"
else
  /bin/echo "DDPM not running."
fi

exit 0
</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.download.DellDisplayAndPeripheralManager</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip/DDPM_Installer.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/DDPM.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/DDPM/DDPM.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
					<dict>
						<key>CFBundleShortVersionString</key>
						<string>%version%</string>
						<key>path</key>
						<string>/Applications/DDPM/DDPM.app</string>
						<key>type</key>
						<string>application</string>
						<key>version_comparison_key</key>
						<string>CFBundleShortVersionString</string>
						<key>CFBundleIdentifier</key>
						<string>Qisda.DDPM</string>
						<key>CFBundleName</key>
						<string>DDPM</string>
					</dict>
					</array>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/unzip</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
        	<dict>
            		<key>Arguments</key>
            		<dict>
                	<key>installs_item_paths</key>
                	<array>
                    		<string>/Applications/DDPM/DDPM.app</string>
                	</array>
                	<key>version_comparison_key</key>
                	<string>CFBundleShortVersionString</string>
            		</dict>
            		<key>Processor</key>
            		<string>MunkiInstallsItemsCreator</string>
        	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>