<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>=== Info ===
		Make one munki override for ARM and Intel, then change DOWNLOAD_URL as you need
		arm64: https://downloads.1password.com/mac/1Password-latest-aarch64.zip
		x86_64: https://downloads.1password.com/mac/1Password-latest.zip
		Change supported_architectures arm64 (M1) or x86_64 (Intel)
	</string>
	<key>Description</key>
	<string>Downloads the latest version of 1Password and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jannheider.munki.1Passwordlatest</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string> === CHANGE ME ===
			arm64 - https://downloads.1password.com/mac/1Password-latest-aarch64.zip
			x86_64 - https://downloads.1password.com/mac/1Password-latest.zip
		</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>1Password latest</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>AgileBits Inc.</string>
			<key>display_name</key>
			<string>1Password</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>supported_architectures</key>
			<array>
				<string>x86_64</string>
				<string>arm64</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jannheider.download.1Passwordlatest</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
