<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Clevershare.</string>
	<key>Identifier</key>
	<string>com.github.jannheider.download.Clevershare</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Clevershare</string>
        <key>SEARCH_URL</key>
        <string>https://www.clevertouch.com/de/clevershare2g</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.clevertouch.com/de/clevershare2g</string>
        <key>SEARCH_PATTERN</key>
        <string>(https://saharaplc\.s3\.eu-west-2\.amazonaws\.com/Clevershare\+\d+/Clients/\d+\.\d+/MacOS\+-\+New/Clevershare-\d+.\d+.\d+.\d+-validated+.dmg)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Clevershare.app</string>
				<key>requirement</key>
				<string>identifier "com.clevertouch.clevershare2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LHZP4ZQ39M</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Clevershare.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
